pipe2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite     3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           5;

functions
{
// NOTE: this calls the bespoke utility and links it to the main solver
CvCalculator
{
    functionObjectLibs ("libCvCalc.so");
    type CvCalc;

    twoDFaceZoneName inletPlaneFaceZone;
    sixDFaceZoneName outletPlaneFaceZone;
    UName U;
    pName p;
    phiName phi;
    inletName inlet;


    writeInterval timeStep;
    writeInterval 1;
}

abortSimulation
{

functionObjectLibs ("libutilityFunctionObjects.so");
type    abort;
file    "finalCv.dat";
action  writeNow;

}

/*pipeCalculator
{
    functionObjectLibs ("libpipeCalc.so");
    type pipeCalc;

    faceZoneName upstream;
    UName U;

    writeInterval timeStep;
    writeInterval 1;
}*/
}

// ************************************************************************* //
