pipe2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

y	100;				//editRadius
x	200;				//editLength

/*
zb	-2.1816615649929116;		//editZBack
zf	2.1816615649929116;		//editZFront
*/
xCells	200;			// number of cells in x direction	//editxCells
yCells	100;			// number of cells in y direction	//edityCells
/*
ILRatio1	0.16164659476572524;			// inflation Layer Ratio w.r.t. radius	//editILRatio1
ILRatio2	0.8383534052342747;			// remaining Layer Ratio w.r.t. radius	//editILRatio2

cellRatio1	0.2777777777777778;			// number of cells in InflationLayer/toatalCells	//editcellRatio1
cellRatio2	0.7222222222222222;			// number of cells in remainingLayer/toatalCells	//editcellRatio2

yGrad		0.1938066994678149;			// gradient in InflationLayer	//edityGrad
*/
vertices
(
	(0 0 -1)		//0
	($x 0 -1)	//1
	($x $y -1)	//2
	(0 $y -1)	//3
	
	(0 0 1)	//4
	($x 0 1)	//5
	($x $y 1)	//6
	(0 $y 1)	//7
	
);


blocks
(
    hex (0 1 2 3 4 5 6 7)
    ($xCells $yCells 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
	);
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (2 3 7 6)
			(0 1 5 4)
        );
    }
    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
    back
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }
);

// ************************************************************************* //
