pipe2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       39700;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       39800;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       39900;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       40300;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       60300;
    }
)

// ************************************************************************* //
